# Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.

# text_str = input('Введите текст')
# word_str = input('Введите слово')
text_str = "Сколько мягких булочек"
word_str = "ко"

print(text_str.find(word_str))
