# Напишите программу,
# которая определит позицию второго вхождения строки в списке
# либо сообщит, что её нет.
# Примеры:
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1


def where_item(lst, str_it):
    cnt = 0
    for i in range(0, len(lst)):
        if lst[i] == str_it:
            cnt += 1
            if cnt == 2:
                return f'Позиция второго вхождения элемента "{str_it}" равна {i}'
    return f'Нет второго вхождения элемента "{str_it}"'


str_list1 = ["qwe", "asd", "zxc", "qwe", "ertqwe"]

str_list2 = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]

str_list3 = ["йцу", "фыв", "ячс", "цук", "йцукен"]

str_list4 = ["123", "234", 123, "567"]

str_list5 = []


print(where_item(str_list1, "qwe"))
print(where_item(str_list2, "йцу"))
print(where_item(str_list3, "йцу"))
print(where_item(str_list4, "123"))
print(where_item(str_list5, "123"))
